In [1]:
import pandas as pd
import numpy as np
from sklearn.tree import DecisionTreeClassifier

In [2]:
data = pd.read_csv('titanic.csv', index_col='PassengerId')

In [3]:
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
data['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [12]:
data.shape

(891, 11)

In [71]:
s = data['Survived'].value_counts()[1]
round(s / data.shape[0] * 100, 2)

38.38

In [24]:
data[data['Pclass'] == 1].shape[0] / data.shape[0] * 100

24.242424242424242

In [72]:
round(data['Age'].mean(),2), data['Age'].median()

(29.7, 28.0)

In [35]:
data.corr() #0.414838

          Survived    Pclass       Age     SibSp     Parch      Fare
Survived  1.000000 -0.338481 -0.077221 -0.035322  0.081629  0.257307
Pclass   -0.338481  1.000000 -0.369226  0.083081  0.018443 -0.549500
Age      -0.077221 -0.369226  1.000000 -0.308247 -0.189119  0.096067
SibSp    -0.035322  0.083081 -0.308247  1.000000  0.414838  0.159651
Parch     0.081629  0.018443 -0.189119  0.414838  1.000000  0.216225
Fare      0.257307 -0.549500  0.096067  0.159651  0.216225  1.000000

In [36]:
data['Name'].head()

PassengerId
1                              Braund, Mr. Owen Harris
2    Cumings, Mrs. John Bradley (Florence Briggs Th...
3                               Heikkinen, Miss. Laina
4         Futrelle, Mrs. Jacques Heath (Lily May Peel)
5                             Allen, Mr. William Henry
Name: Name, dtype: object

In [39]:
data[data['Sex'] == 'female']['Name'].value_counts()

Eustis, Miss. Elizabeth Mussey                              1
Devaney, Miss. Margaret Delia                               1
Lobb, Mrs. William Arthur (Cordelia K Stanlick)             1
Turpin, Mrs. William John Robert (Dorothy Ann Wonnacott)    1
Kelly, Miss. Mary                                           1
Becker, Miss. Marion Louise                                 1
Meek, Mrs. Thomas (Annie Louise Rowley)                     1
Robins, Mrs. Alexander A (Grace Charity Laury)              1
Cleaver, Miss. Alice                                        1
McGowan, Miss. Anna "Annie"                                 1
Van Impe, Miss. Catharina                                   1
O'Sullivan, Miss. Bridget Mary                              1
Keane, Miss. Nora A                                         1
Parrish, Mrs. (Lutie Davis)                                 1
Wells, Miss. Joan                                           1
Maioni, Miss. Roberta                                       1
Andersson, Miss. Sigrid Elisabeth                           1
Appleton, Mrs. Edward Dale (Charlotte Lamson)               1
Aks, Mrs. Sam (Leah Rosen)                                  1
Hart, Miss. Eva Miriam                                      1
Canavan, Miss. Mary                                         1
Johnston, Miss. Catherine Helen "Carrie"                    1
Healy, Miss. Hanora "Nora"                                  1
Renouf, Mrs. Peter Henry (Lillian Jefferys)                 1
Skoog, Mrs. William (Anna Bernhardina Karlsson)             1
Christy, Miss. Julie Rachel                                 1
Fortune, Miss. Alice Elizabeth                              1
O'Brien, Mrs. Thomas (Johanna "Hannah" Godfrey)             1
Heikkinen, Miss. Laina                                      1
Newsom, Miss. Helen Monypeny                                1
                                                           ..
Madill, Miss. Georgette Alexandra                           1
Arnold-Franchi, Mrs. Josef (Josefine Franchi)               1
Kenyon, Mrs. Frederick R (Marion)                           1
Trout, Mrs. William H (Jessie L)                            1
Van Impe, Mrs. Jean Baptiste (Rosalie Paula Govaert)        1
Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)               1
Francatelli, Miss. Laura Mabel                              1
Kantor, Mrs. Sinai (Miriam Sternin)                         1
Turkula, Mrs. (Hedwig)                                      1
Brown, Miss. Amelia "Mildred"                               1
Laitinen, Miss. Kristina Sofia                              1
Andersson, Miss. Erna Alexandra                             1
Toomey, Miss. Ellen                                         1
Boulos, Mrs. Joseph (Sultana)                               1
Nysten, Miss. Anna Sofia                                    1
Osman, Mrs. Mara                                            1
Andersson, Miss. Ellis Anna Maria                           1
Hart, Mrs. Benjamin (Esther Ada Bloomfield)                 1
Davison, Mrs. Thomas Henry (Mary E Finck)                   1
Mayne, Mlle. Berthe Antonine ("Mrs de Villiers")            1
Goldsmith, Mrs. Frank John (Emily Alice Brown)              1
Taylor, Mrs. Elmer Zebley (Juliet Cummins Wright)           1
Andersen-Jensen, Miss. Carla Christine Nielsine             1
Brown, Mrs. James Joseph (Margaret Tobin)                   1
Bowerman, Miss. Elsie Edith                                 1
Isham, Miss. Ann Elizabeth                                  1
Baxter, Mrs. James (Helene DeLaudeniere Chaput)             1
Moor, Mrs. (Beila)                                          1
Wick, Miss. Mary Natalie                                    1
Meanwell, Miss. (Marion Ogden)                              1
Name: Name, Length: 314, dtype: int64

In [41]:
d = data[data['Sex'] == 'female']['Name']

#for i in d:
d.iloc[0].

'Cumings, Mrs. John Bradley (Florence Briggs Thayer)'

In [52]:
n = data[data['Sex'] == 'female']['Name'].str.split()
n.head()

PassengerId
2     [Cumings,, Mrs., John, Bradley, (Florence, Bri...
3                            [Heikkinen,, Miss., Laina]
4     [Futrelle,, Mrs., Jacques, Heath, (Lily, May, ...
9     [Johnson,, Mrs., Oscar, W, (Elisabeth, Vilhelm...
10            [Nasser,, Mrs., Nicholas, (Adele, Achem)]
Name: Name, dtype: object

In [88]:
names=[]
for i in n:
    for k in i:
        if k == 'Miss.' or k == 'Mrs.':
            if i[i.index(k)+1].find('(') != -1:
                w = i[i.index(k)+1].split('(')
                b = w[1].split(')')
                names.append(b[0])
            else:
                names.append(i[i.index(k)+1])

In [89]:
len(names)

307

In [93]:
d = pd.Series(names)
d.value_counts()

William      13
Mary         11
Anna          9
Elizabeth     8
Margaret      6
Thomas        6
John          6
Frederick     5
Edward        4
James         4
Alice         4
Bertha        4
Ellen         4
Helen         4
Annie         3
Amelia        3
Katherine     3
Catherine     3
Joseph        3
Samuel        3
Kate          3
Marion        3
Augusta       3
Henry         3
Charles       3
Hanora        3
Emily         2
Albert        2
George        2
Marie         2
             ..
Ingeborg      1
Carl          1
Hileni        1
Agnes         1
Eliina        1
Percival      1
Ellis         1
Sara          1
Laura         1
Matilda       1
Guillaume     1
Virginia      1
Erna          1
Elmer         1
Victor        1
Stina         1
Kristina      1
Florence      1
Karolina      1
Lizzie        1
Norman        1
Edwina        1
Mathilde      1
Karl          1
Sinai         1
Edwy          1
Eugenie       1
Louis         1
Gretchen      1
Maria         1
Length: 190, dtype: int64

In [58]:
new=[]
for i in names:
    i.split('(')
    
    i.split(')')
    new.append(i)

In [66]:
a = new[8].split('(')
b = a[1].split(')')

In [68]:
b[0]

'Mary'

In [69]:
a = new[7].split('(')
b = a[1].split(')')

IndexError: list index out of range